---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarShapeDefinition.Dispose
source: html/bfd06e38-ab77-d149-4da0-43ecc8837793.htm
---
# Autodesk.Revit.DB.Structure.RebarShapeDefinition.Dispose Method

Releases all resources used by the RebarShapeDefinition

## Syntax (C#)
```csharp
public void Dispose()
```